[
    {
        "company": "Gray Whale",
        "title": "AI & Software Systems Engineer",
        "location": "Santa Cruz, CA",
        "startDate": "June 2025",
        "endDate": "Present",
        "link": "https://graywhale.ai/",
        "description": "- Working across software development, data engineering, and system design to support Gray Whale's product and platform initiatives\n- Designing automation tools, internal services, and backend workflows to streamline operations and improve scalability\n- Supporting creative and product-facing efforts, including interface design, marketing systems, and communication infrastructure",
        "skills": [
            "Software Development",
            "Data Engineering",
            "System Design",
            "Automation",
            "Backend Development",
            "AI/ML Systems"
        ],
        "highlightColor": {
            "light": "#2c3e50",
            "dark": "#34495e"
        }
    },
    {
        "company": "Onda Sports Inc.",
        "title": "AI Engineer & Product Consultant",
        "location": "Remote",
        "startDate": "May 2025",
        "endDate": "Present",
        "link": "https://getonda.ai/",
        "description": "- Developing intelligent assistant features that help surfers\n- Leveraging large language models (LLMs) to power conversational tools and curated recommendations\n- Supporting Onda's mission to make surf forecasting more personalized, contextual, and accessible\n- Designing new product experiences at the intersection of AI, usability, and surf culture\n- Advising Onda's marketing strategy, including recommending scalable outreach initiatives and influencing the hiring of a summer intern team to support marketing, content, and community efforts",
        "skills": [
            "Artificial Intelligence (AI)",
            "Machine Learning",
            "Software Development",
            "Natural Language Processing (NLP)",
            "Product Consulting",
            "Marketing Strategy"
        ],
        "highlightColor": {
            "light": "#00acc1",
            "dark": "#26c6da"
        }
    },
    {
        "company": "Baskin Engineering at UCSC",
        "title": "Teaching Assistant",
        "location": "Santa Cruz, CA",
        "startDate": "September 2024",
        "endDate": "Present",
        "link": "https://engineering.ucsc.edu/",
        "description": "- TA for courses led by Professor Paul Vroomen in the Technology Information Management Department\n- Delivered academic support through office hours, grading assignments and exams, and lecturing to over 150 students; served as Lead TA, coordinating the TA/grading team\n- Guided student learning across databases, SQL, business processes, information systems, systems analysis, UML modeling, and Agile/SCRUM methodologies\n- Mentored student team projects focused on app development, supporting their use of industry practices from requirements gathering through sprint planning and stakeholder feedback",
        "skills": [
            "Teaching Assistance",
            "Academic Guidance",
            "Agile Methodologies",
            "UML Modeling",
            "Student Engagement"
        ],
        "highlightColor": {
            "light": "#003c6c",
            "dark": "#64b5f6"
        }
    },
    {
        "company": "Boardal",
        "title": "Software Developer & Consultant - Agile Methodology Specialist",
        "location": "San Diego, CA",
        "startDate": "April 2024",
        "endDate": "June 2025",
        "link": "https://boardal.app/",
        "description": "- Drove Boardal's app's growth to over 20,000 users through product improvements and automation tools\n- Built GPT-powered systems to streamline marketing outreach and customer communication\n- Created features like personalized alerts and spreadsheet-integrated tools to boost user engagement and team efficiency\n- Led Agile adoption to speed up development and better align with user needs\n- Contributed across the stack to expand app functionality and support startup growth",
        "skills": [
            "Software Development",
            "Agile Methodologies",
            "Full-Stack Development",
            "Mobile Applications",
            "Machine Learning Integration"
        ],
        "highlightColor": {
            "light": "#00bcd4",
            "dark": "#4dd0e1"
        }
    },
    {
        "company": "Adventure Out LLC",
        "title": "Surf Instructor",
        "location": "Santa Cruz, CA",
        "startDate": "June 2023",
        "endDate": "December 2023",
        "link": "https://www.adventureout.com/",
        "description": "- Taught private and group surf lessons to students of all ages and experience levels, adapting instruction to individual learning styles\n- Emphasized ocean safety, hazard awareness, and proper navigation techniques in every session\n- Introduced core surf skills and ocean knowledge, creating a strong foundation for beginner surfers\n- Delivered a personalized and confidence-building learning environment in dynamic ocean conditions",
        "skills": [
            "Fitness Instruction",
            "Time Management",
            "Leadership",
            "Customer Service"
        ],
        "highlightColor": {
            "light": "#4caf50",
            "dark": "#81c784"
        }
    },
    {
        "company": "University of California Santa Cruz",
        "title": "Peer Advisor",
        "location": "Santa Cruz, CA",
        "startDate": "July 2021",
        "endDate": "September 2023",
        "link": "https://undergrad.engineering.ucsc.edu/advising/peer-advisors/",
        "description": "- Provided front-line support to a diverse student body, including four-year and transfer students, enhancing their academic experience.\n- Assisted students with class enrollment, graduation planning, and petition processes, leveraging strong problem-solving skills.\n- Directed students and visitors to appropriate departments and faculty, contributing positively to their academic journey.\n- Utilized exceptional communication and interpersonal skills to connect individuals with necessary resources and support.",
        "skills": [
            "Customer Service",
            "Communication",
            "Teamwork",
            "Academic Advising"
        ],
        "highlightColor": {
            "light": "#003c6c",
            "dark": "#64b5f6"
        }
    },
    {
        "company": "University of California Santa Cruz",
        "title": "Maintenance Worker",
        "location": "Santa Cruz, CA",
        "startDate": "June 2022",
        "endDate": "September 2022",
        "link": "https://ches.ucsc.edu/cruzfix/",
        "description": "- Ensured dorms and campus buildings were well-maintained, conducting repairs in rooms and maintaining plumbing systems.\n- Responded promptly to maintenance requests from students and staff, ensuring a safe and comfortable living and learning environment.\n- Kept detailed records of all maintenance work performed, demonstrating organizational skills and attention to detail.",
        "skills": [
            "Time Management",
            "Attention to Detail",
            "Customer Service",
            "Problem Solving",
            "Teamwork"
        ],
        "highlightColor": {
            "light": "#003c6c",
            "dark": "#64b5f6"
        }
    },
    {
        "company": "University of California Santa Cruz",
        "title": "Programs Assistant",
        "location": "Santa Cruz, CA",
        "startDate": "July 2020",
        "endDate": "January 2022",
        "link": "https://rachelcarson.ucsc.edu/",
        "description": "- Led the planning and execution of various Rachel Carson College community events, focusing on environmental and cultural themes, to enhance campus life.\n- Developed and executed creative event concepts and educational content, promoting environmental awareness and enriching the college's thematic focus.\n- Demonstrated strong organizational and project management skills, bringing innovative ideas to life and ensuring broad community engagement through comprehensive marketing campaigns.\n- Utilized posters, social media, emails, and slideshows in collaboration with team members for event promotion and educational initiatives, effectively increasing awareness and participation.",
        "skills": [
            "Leadership",
            "Attention to Detail",
            "Customer Service",
            "Problem Solving",
            "Teamwork"
        ],
        "highlightColor": {
            "light": "#003c6c",
            "dark": "#64b5f6"
        }
    },
    {
        "company": "Club Ed Surf School and Camps",
        "title": "Surf Instructor",
        "location": "Santa Cruz, CA",
        "startDate": "June 2021",
        "endDate": "October 2021",
        "link": "https://club-ed.com/",
        "description": "- Provided comprehensive surf lessons to individuals of diverse ages and skill levels, focusing on safety, technique, and personalized instruction.\n- Delivered essential safety instructions to ensure students understood potential hazards and safe navigation of ocean conditions.\n- Taught fundamental surf techniques, adjusting teaching methods to match the unique needs and abilities of each student for optimal learning.\n- Maintained and managed surf equipment, ensuring all gear was in excellent condition for lessons.\n- Assisted with the logistical aspects of equipment transportation, coordinating between the Club Ed Office and lesson locations.",
        "skills": [
            "Fitness Instruction",
            "Time Management",
            "Leadership",
            "Customer Service",
            "Hospitality"
        ],
        "highlightColor": {
            "light": "#ff9800",
            "dark": "#ffb74d"
        }
    },
    {
        "company": "YMCA of San Diego County",
        "title": "Skateboarding Instructor",
        "location": "San Diego, CA",
        "startDate": "June 2019",
        "endDate": "September 2019",
        "link": "https://www.ymcasd.org/mission-valley-ymca-krause-family-skate-bike-park",
        "description": "- Designed and delivered individualized skateboarding lessons, adapting instruction to each student's skill level and learning pace\n- Used hands-on, progressive techniques to build student confidence and foster an inclusive, encouraging environment for learners of all backgrounds and abilities\n- Assisted in the Clash at Clairemont skateboarding demo event, supporting logistics and event setup for a showcase featuring pro skaters including Tony Hawk, Andy Macdonald, and many more\n- Returned to teach a decade after attending the program myself, reflecting a full-circle experience and a deep connection to the skateboarding community",
        "skills": [
            "Fitness Instruction",
            "Customer Service",
            "Hospitality"
        ],
        "highlightColor": {
            "light": "#e91e63",
            "dark": "#f06292"
        }
    }
]
