[
    {
        "company": "Baskin Engineering at UCSC",
        "title": "Teaching Assistant for Professor Paul Vroomen",
        "location": "Santa Cruz, CA",
        "startDate": "September 2024",
        "endDate": "Present",
        "link": "https://engineering.ucsc.edu/",
        "description": "- Supporting over 100 students across two courses:\n  - TIM 50 - Business Information Systems (Fall 2024): Helped students master databases, business processes, and information systems.\n  - TIM 58 - Systems Analysis and Design (Winter 2025): Guided students in systems thinking, UML modeling, and agile methodologies.\n- Led mock stakeholder interactions to simulate real-world challenges, providing actionable feedback on team project deliverables.\n- Delivered engaging course content, led discussion sections, and held office hours to support individual and group learning.\n- Provided detailed feedback on assignments and exams, improving student comprehension and engagement.\n- Fostered collaboration among students while preparing them for professional environments.",
        "skills": [
            "Teaching Assistance",
            "Academic Guidance",
            "Agile Methodologies",
            "UML Modeling",
            "Student Engagement"
        ]
    },
    {
        "company": "Boardal",
        "title": "Software Developer & Consultant - Agile Methodology Specialist",
        "location": "San Diego, CA",
        "startDate": "April 2024",
        "endDate": "Present",
        "link": "https://boardal.app/",
        "description": "- Developed a custom GPT-driven system to automate outbound messaging for marketing interns, streamlining customer acquisition and eliminating the need for manual message creation.\n- Integrated a spreadsheet-linked GPT tool that allows marketing interns to query customer records and track communication status, improving efficiency and ensuring accurate outreach.\n- Designed and deployed a custom notification system, enabling users to create personalized alerts for surfboards matching their preferences, resulting in a 25% increase in daily app usage.\n- Spearheaded the implementation of Agile methodologies, improving team collaboration, accelerating feature delivery, and aligning the app’s development process with user needs.\n- Actively contributed to expanding the app’s capabilities by integrating new features and adapting to the evolving needs of the startup to ensure scalability and user satisfaction.",
        "skills": [
            "Software Development",
            "Agile Methodologies",
            "Full-Stack Development",
            "Mobile Applications",
            "Machine Learning Integration"
        ]
    }

    {
        "company": "Adventure Out LLC",
        "title": "Surf Instructor",
        "location": "Santa Cruz, CA",
        "startDate": "June 2023",
        "endDate": "December 2023",
        "link": "https://www.adventureout.com/",
        "description": "- Taught surf lessons to a diverse range of students, including all skill levels and ages, ensuring a personalized learning experience.\n- Delivered comprehensive safety instructions, focusing on identifying potential hazards and safe ocean navigation techniques.\n- Introduced fundamental surf techniques, laying a solid foundation for students' surfing skills.\n- Customized each lesson to match the unique needs and abilities of individual students, fostering a supportive and effective learning environment.",
        "skills": [
            "Fitness Instruction",
            "Time Management",
            "Leadership",
            "Customer Service"
        ]
    },
    {
        "company": "University of California Santa Cruz",
        "title": "Peer Advisor",
        "location": "Santa Cruz, CA",
        "startDate": "July 2021",
        "endDate": "September 2023",
        "link": "https://undergrad.engineering.ucsc.edu/advising/peer-advisors/",
        "description": "- Provided front-line support to a diverse student body, including four-year and transfer students, enhancing their academic experience.\n- Assisted students with class enrollment, graduation planning, and petition processes, leveraging strong problem-solving skills.\n- Directed students and visitors to appropriate departments and faculty, contributing positively to their academic journey.\n- Utilized exceptional communication and interpersonal skills to connect individuals with necessary resources and support.",
        "skills": [
            "Customer Service",
            "Communication",
            "Teamwork",
            "Academic Advising"
        ]
    },
    {
        "company": "University of California Santa Cruz",
        "title": "Maintenance Worker",
        "location": "Santa Cruz, CA",
        "startDate": "June 2022",
        "endDate": "September 2022",
        "link": "https://ches.ucsc.edu/cruzfix/",
        "description": "- Ensured dorms and campus buildings were well-maintained, conducting repairs in rooms and maintaining plumbing systems.\n- Responded promptly to maintenance requests from students and staff, ensuring a safe and comfortable living and learning environment.\n- Kept detailed records of all maintenance work performed, demonstrating organizational skills and attention to detail.",
        "skills": [
            "Time Management",
            "Attention to Detail",
            "Customer Service",
            "Problem Solving",
            "Teamwork"
        ]
    },
    {
        "company": "University of California Santa Cruz",
        "title": "Programs Assistant",
        "location": "Santa Cruz, CA",
        "startDate": "July 2020",
        "endDate": "January 2022",
        "link": "https://rachelcarson.ucsc.edu/",
        "description": "- Led the planning and execution of various Rachel Carson College community events, focusing on environmental and cultural themes, to enhance campus life.\n- Developed and executed creative event concepts and educational content, promoting environmental awareness and enriching the college's thematic focus.\n- Demonstrated strong organizational and project management skills, bringing innovative ideas to life and ensuring broad community engagement through comprehensive marketing campaigns.\n- Utilized posters, social media, emails, and slideshows in collaboration with team members for event promotion and educational initiatives, effectively increasing awareness and participation.",
        "skills": [
            "Leadership",
            "Attention to Detail",
            "Customer Service",
            "Problem Solving",
            "Teamwork"
        ]
    },
    {
        "company": "Club Ed Surf School and Camps",
        "title": "Surf Instructor",
        "location": "Santa Cruz, CA",
        "startDate": "June 2021",
        "endDate": "October 2021",
        "link": "https://club-ed.com/",
        "description": "- Provided comprehensive surf lessons to individuals of diverse ages and skill levels, focusing on safety, technique, and personalized instruction.\n- Delivered essential safety instructions to ensure students understood potential hazards and safe navigation of ocean conditions.\n- Taught fundamental surf techniques, adjusting teaching methods to match the unique needs and abilities of each student for optimal learning.\n- Maintained and managed surf equipment, ensuring all gear was in excellent condition for lessons.\n- Assisted with the logistical aspects of equipment transportation, coordinating between the Club Ed Office and lesson locations.",
        "skills": [
            "Fitness Instruction",
            "Time Management",
            "Leadership",
            "Customer Service",
            "Hospitality"
        ]
    },
    {
        "company": "YMCA of San Diego County",
        "title": "Skateboarding Instructor",
        "location": "San Diego, CA",
        "startDate": "June 2019",
        "endDate": "September 2019",
        "link": "https://www.ymcasd.org/mission-valley-ymca-krause-family-skate-bike-park",
        "description": "- Managed and tailored individualized skateboarding lessons to each student's needs and abilities, ensuring a personalized learning experience.\n- Provided comprehensive safety instruction and promoted the proper usage of gear to minimize risks during lessons.\n- Employed hands-on teaching methods to effectively aid students in progressing their skateboarding skills.\n- Fostered a positive and inclusive learning environment, encouraging students of all levels to engage and improve confidently.\n- Found it rewarding to come full circle, teaching skateboarding lessons a decade after being a student myself, highlighting the enduring impact and personal growth within the skateboarding community.",
        "skills": [
            "Fitness Instruction",
            "Customer Service",
            "Hospitality"
        ]
    }
]
