[
    {
            "title": "Relation Extraction from Natural Language using PyTorch",
            "startDate": "October 2024",
            "endDate": "October 2024",
            "link": "https://github.com/iamsorenl/Relation-Extraction-from-Natural-Language-using-PyTorch",
            "muiIcon": "AutoAwesome",
            "description": "Developed a deep learning model to accurately predict knowledge graph relations from user utterances in a conversational AI system. Leveraging a dataset of natural language sentences paired with relations from the Freebase schema, I built and optimized a multi-layer perceptron (MLP) using PyTorch. This model utilizes static embeddings generated by spaCy to extract key relations from new utterances in real-time. \n\nThe model was trained using advanced techniques like K-fold cross-validation to ensure robust performance across multiple folds, and various evaluation metrics like accuracy and F1-score were used to validate its effectiveness. This project demonstrates the application of state-of-the-art NLP methods for enhancing machine understanding in conversational agents, making it a valuable tool for tasks such as knowledge graph completion and information retrieval.",
            "tools": [
                "Python",
                "PyTorch",
                "spaCy",
                "Pandas",
                "Scikit-Learn",
                "K-fold Cross-Validation"
            ]
    },
    {
        "title": "Baskin Engineering Peer Advisor GPT Chatbot",
        "startDate": "November 2023",
        "endDate": "June 2024",
        "link": "https://chat.openai.com/g/g-lV8OpojdP-baskin-engineering-undergraduate-peer-advisor",
        "muiIcon": "Message",
        "description": "The Peer Advisor GPT project at UC Santa Cruz's Baskin School of Engineering showcases an AI-driven tool aimed at enhancing the advising experience for students. It provides customized guidance across academic and administrative queries by leveraging AI to understand individual needs based on major, academic progress, and course interests. The tool offers class recommendations, scheduling assistance, and petition navigation, among other features. It's a testament to the application of AI and machine learning in educational settings, demonstrating significant potential for reducing advisor workloads while delivering timely and precise advice to students.",
        "tools": [
            "ChatGPT"
        ]
    },
    {
        "title": "To Do List",
        "startDate": "September 2023",
        "endDate": "September 2023",
        "link": "https://github.com/iamsorenl/ToDoList.git",
        "muiIcon": "Checklist",
        "description": "This project is a simple To-Do List application built using Vue.js, Flask, and Bootstrap, demonstrating the integration of a frontend JavaScript framework (Vue.js) with a backend Python framework (Flask), along with the use of Bootstrap for styling and responsiveness. Users can add, edit, mark as completed, and delete tasks, with all data being stored on the server. The project includes CORS (Cross-Origin Resource Sharing) configuration to handle requests from different origins, ensuring a seamless user experience while interacting with the application.",
        "tools": [
            "Vue.js",
            "Flask",
            "Axios",
            "Cors",
            "Bootstrap"
        ]
    },
    {
        "title": "Personal Porfolio Site",
        "startDate": "July 2023",
        "endDate": "August 2023",
        "link": "https://github.com/iamsorenl/soren-larsen.git",
        "muiIcon": "Folder",
        "description": "As a skilled developer, I've created an engaging and dynamic portfolio using a combination of React.js, Node.js, Material UI, and Firebase technologies. This platform highlights my journey, experiences, and projects in a seamless and captivating manner. With expertise in responsive design, I've harnessed the power of Material UI and React tools to ensure an optimal user experience across devices. The portfolio showcases a diverse range of projects, from interactive web applications to innovative software solutions, each with relevant links for further exploration. Moreover, the portfolio boasts a unique visual element - an ever-changing photo gallery that refreshes every 30 seconds. Through this project, I've not only honed my technical skills but also exhibited creativity and adaptability in design and presentation. Feel free to explore the various sections like Projects and Experience to gain insights into my proficiency and passion for web development.",
        "tools": [
            "React.js",
            "Material UI",
            "Node.js",
            "Firebase"
        ]
    },
    {
        "title": "Messaging Service",
        "startDate": "March 2023",
        "endDate": "June 2023",
        "link": "https://gitfront.io/r/iamsorenl/TbpzioKijiha/Messaging-Service/",
        "muiIcon": "Message",
        "description": "I took on the unique challenge of building a messaging app, similar to that of Discord or Slack, not just once, but three times using Kotlin, Swift, and React Native. This involved developing separate versions of the app in each language, showcasing my versatility and adaptability across different mobile development ecosystems. Throughout the development process, I practiced thorough testing to ensure the reliability and functionality of the apps. To achieve this, I employed testing frameworks such as Barista for Kotlin, XCTest for Swift, and Jest for React Native. Through rigorous testing, I evaluated the user interface and functionality, ensuring a seamless and high-quality user experience across all three implementations. This project highlighted my ability to not only develop applications in multiple languages but also to rigorously test and optimize them for robustness, delivering exceptional performance in each platform.",
        "tools": [
            "Kotlin",
            "Swift",
            "React Native",
            "Barista",
            "XCTest",
            "Jest"
        ]
    },
    {
        "title": "ParkMe",
        "startDate": "January 2023",
        "endDate": "March 2023",
        "link": "https://gitfront.io/r/iamsorenl/3GNVBXrchghV/ParkMe/",
        "muiIcon": "DirectionsCar",
        "description": "As the product owner of the ParkMe team, I spearheaded the development of our mobile app. By leveraging the combination of Flutter, Node.js, Typescript, TSOA, and PostgreSQL, my team crafted an app that empowers users to list their private spots for rent or find and rent available spots listed by other users. In this pivotal role, I not only oversaw the product roadmap but also took charge of prioritizing features that aligned with the vision and goals of the service. By effectively managing resource allocation and providing the development team with essential information and tools, I ensured the creation of a highly functional and user-friendly product. Additionally, I made significant programming contributions to the app. One notable accomplishment was setting up the team's Google Cloud account and integrating essential APIs such as Google Maps and address autocomplete into our product. By doing so, we provided seamless location-based services, allowing users to easily navigate and find parking spots with accurate mapping capabilities. Furthermore, I made substantial contributions to the backend development by writing the necessary backend routes for rental transactions.",
        "tools": [
            "Dart",
            "Flutter",
            "PostgreSQL",
            "Node.js",
            "Typescript",
            "TSOA"
        ]
    },
    {
        "title": "HTTP Server",
        "startDate": "October 2022",
        "endDate": "December 2022",
        "link": "https://gitfront.io/r/iamsorenl/nmB54YoNBezS/Principles-of-Computer-Systems-Design/",
        "muiIcon": "Http",
        "description": "I designed and implemented a high-performance, multithreaded HTTP server using the C programming language. The server incorporated a simplified HTTP protocol, complete with codes for essential responses such as 200, 201, 404, and 500. Leveraging socket programming techniques, I ensured reliable and efficient communication between the server and clients. To ensure optimal performance and thread safety, I implemented threadsafe operations for essential HTTP methods such as GET, PUT, and HEAD. This involved carefully managing concurrent access to shared resources and handling potential race conditions. In addition to core functionalities, I implemented robust byte parsing for handling and processing requests. This enabled efficient extraction and interpretation of data from the requests, facilitating seamless communication and accurate responses between the server and clients. To enhance usability and flexibility, the server allowed for a user-specified number of working threads, enabling customizable resource utilization. Moreover, I incorporated an audit log file, which captured important server events and client interactions, providing a valuable tool for debugging and monitoring.",
        "tools": [
            "C",
            "Bash",
            "Multithreaded Development",
            "Mutex Locks"
        ]
    },
    {
        "title": "Email Service",
        "startDate": "July 2022",
        "endDate": "July 2022",
        "link": "https://gitfront.io/r/iamsorenl/watXvfgwYEzr/Email-Service/",
        "muiIcon": "AlternateEmail",
        "description": "I developed a comprehensive email system utilizing the versatile tech stack of React, Node.js, Express, PostgreSQL, and Material UI. The system's core functionalities encompass sending and receiving emails, allowing users to navigate through various mailboxes such as the inbox, sent folder, and custom folders. Additionally, users can create personalized mailboxes to suit their specific needs, enhancing organization and customization options.",
        "tools": [
            "React.js",
            "Node.js",
            "Express",
            "PostgreSQL",
            "Material UI"
        ]
    },
    {
        "title": "NLP Sentiment Analysis",
        "startDate": "March 2022",
        "endDate": "June 2022",
        "link": "https://gitfront.io/r/iamsorenl/4viJLvCh4wdj/NLP-Sentiment-Analysis/",
        "muiIcon": "Abc",
        "description": "I collaborated as a member of a dedicated team on an NLP project with the objective of enhancing sentiment analysis accuracy in text data. Through our collective efforts, we leveraged advanced machine learning techniques, such as RNNs and LSTMs, to capture contextual information and long-term dependencies within the text. The project encompassed various tasks, including data preprocessing, model development utilizing Python and Keras, and training and evaluation on diverse datasets like IMDB. This experience not only fortified my skills in NLP, machine learning, and model optimization but also highlighted the value of collaborative peer programming and teamwork in achieving our goals.",
        "tools": [
            "Python",
            "Keras",
            "Tensorflow",
            "sklearn",
            "numpy"
        ]
    }
]
